{"class_name": "Sequential", "backend": "tensorflow", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "dtype": "float32", "batch_input_shape": [null, 32, 128, 3], "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "conv2d_1", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "filters": 16, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "conv2d_2", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "filters": 32, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "data_format": "channels_last", "strides": [1, 1], "padding": "valid", "name": "conv2d_3", "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "filters": 64, "kernel_constraint": null, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"dtype": "float32", "trainable": true, "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"dtype": "float32", "name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "units": 500, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "seed": null, "dtype": "float32", "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "units": 100, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.25, "seed": null, "dtype": "float32", "noise_shape": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "units": 20, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "units": 1, "dtype": "float32", "kernel_regularizer": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_constraint": null, "kernel_constraint": null}}]}, "keras_version": "2.3.1"}